Revit 2027 API
Dimension.HasLeader Property
 True if dimension has leader, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasLeader { get; set; }
Public Property HasLeader As Boolean
	Get
	Set
public:
property bool HasLeader {
	bool get ();
	void set (bool value);
}
member HasLeader : bool with get, set
Property Value
Boolean
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace